Repository: nancybwi/DrainGuardHCM
Catalog: DrainGuardHCM/*.lproj/Localizable.strings
Languages: vi

# profile.title
source: Profile
vi: Cá nhân

# profile.no_email
source: No email yet
vi: Chưa có email

# profile.stats
source: Stats
vi: Thống kê

# profile.stats_sent
source: Sent
vi: Đã gửi

# profile.stats_in_progress
source: In progress
vi: Đang xử lý

# profile.stats_done
source: Completed
vi: Hoàn thành

# profile.info
source: Info
vi: Thông tin

# profile.phone
source: Phone
vi: Số điện thoại

# profile.district
source: Area
vi: Khu vực

# profile.settings
source: Settings
vi: Cài đặt

# profile.language
source: Language
vi: Ngôn ngữ

# profile.language_sub
source: Switch English/Vietnamese
vi: Chuyển English/Tiếng Việt

# profile.notifications
source: Notifications
vi: Thông báo

# profile.notifications_sub
source: Receive report status updates
vi: Nhận cập nhật trạng thái báo cáo

# profile.share_location
source: Share location
vi: Chia sẻ vị trí

# profile.share_location_sub
source: Suggest nearby drains
vi: Gợi ý cống gần bạn

# profile.logout
source: Logout
vi: Đăng xuất

# auth.login
source: Login
vi: Đăng nhập

# auth.register
source: Register
vi: Đăng ký

# auth.password
source: Password
vi: Mật khẩu

# auth.create_account
source: Create account
vi: Tạo tài khoản

# auth.have_account_login
source: Already have an account? Login
vi: Đã có tài khoản? Đăng nhập

# auth.no_account_register
source: No account? Register
vi: Chưa có tài khoản? Đăng ký

# home.hello
source: Hello
vi: Xin chào

# home.flood_alert_title
source: Flood alert
vi: Cảnh báo ngập

# home.flood_alert_subtitle
source: 3 high-risk spots near you
vi: 3 điểm nguy cơ cao gần bạn

# home.stats_sent
source: Reports sent
vi: Báo cáo đã gửi

# home.stats_done
source: Completed
vi: Đã hoàn thành

# home.recent_reports
source: Recent reports
vi: Báo cáo gần đây

# home.news
source: News
vi: Tin tức

# home.quick_actions
source: Quick actions
vi: Hành động nhanh

# home.action.flood_map
source: Flood map
vi: Bản đồ ngập

# home.action.find_route
source: Find route
vi: Tìm đường

# common.view
source: View
vi: Xem

# common.see_more
source: See more
vi: Xem thêm

# status.sent
source: Sent
vi: Đã gửi

# status.in_progress
source: In progress
vi: Đang xử lý

# status.done
source: Done
vi: Hoàn thành

# report.submit
source: Submit report
vi: Gửi báo cáo

# report.severity
source: How bad is it?
vi: Mức độ ngập?

# report.drain_nearby
source: Do you see a drain nearby?
vi: Bạn có thấy cống thoát nước gần đó không?

# report.traffic
source: Traffic right now?
vi: Tình trạng giao thông hiện tại?

# option.low
source: Low
vi: Nhẹ

# option.medium
source: Medium
vi: Trung bình

# option.high
source: High
vi: Nặng

# option.yes
source: Yes
vi: Có

# option.no
source: No
vi: Không

# option.unsure
source: Not sure
vi: Không rõ

# traffic.normal
source: Normal
vi: Bình thường

# traffic.slowing
source: Slowing
vi: Di chuyển chậm

# traffic.blocked
source: Blocked
vi: Bị chặn

# tab.home
source: Home
vi: Trang chủ

# tab.map
source: Map
vi: Bản đồ

# tab.status
source: Status
vi: Trạng thái

# tab.profile
source: Profile
vi: Cá nhân

# status.title.allReports
source: All Reports
vi: Tất cả báo cáo

# status.title.myReports
source: My Reports
vi: Báo cáo của tôi

# status.loading
source: Loading reports…
vi: Đang tải báo cáo…

# status.error.title
source: Error loading reports
vi: Lỗi khi tải báo cáo

# status.empty.pending
source: No pending reports
vi: Không có báo cáo đang chờ

# status.empty.inProgress
source: No in-progress reports
vi: Không có báo cáo đang xử lý

# status.empty.done
source: No done reports
vi: Không có báo cáo đã xong

# status.tab.pending
source: Pending
vi: Chờ xử lý

# status.tab.inProgress
source: In Progress
vi: Đang xử lý

# status.tab.done
source: Done
vi: Hoàn tất

# weather.city.hcm
source: Ho Chi Minh City
vi: TP.HCM

# weather.condition.lightRain
source: Light rain
vi: Mưa nhẹ

# weather.summary.rainingNow
source: It’s raining now
vi: Trời đang mưa

# weather.rainChance %d
source: Rain chance: %d%%
vi: Khả năng mưa: %d%%

# weather.action.detail
source: Details
vi: Chi tiết

# reportDetail.title
source: Report Details
vi: Chi tiết báo cáo

# reportDetail.loading
source: Loading report...
vi: Đang tải báo cáo...

# reportDetail.goBack
source: Go Back
vi: Quay lại

# reportDetail.unknown
source: Unknown
vi: Không rõ

# reportDetail.photoEvidence
source: Photo Evidence
vi: Ảnh minh chứng

# reportDetail.photoFailed
source: Failed to load image
vi: Không thể tải ảnh

# reportDetail.basicInfo
source: Basic Information
vi: Thông tin cơ bản

# reportDetail.drainLocation
source: Drain Location
vi: Vị trí cống

# reportDetail.severity
source: Severity
vi: Mức độ

# reportDetail.trafficImpact
source: Traffic Impact
vi: Ảnh hưởng giao thông

# reportDetail.location
source: Location
vi: Vị trí

# reportDetail.showMap
source: Show Map
vi: Xem bản đồ

# reportDetail.hideMap
source: Hide Map
vi: Ẩn bản đồ

# reportDetail.marker.drain
source: Drain
vi: Cống

# reportDetail.riskAssessment
source: Risk Assessment
vi: Đánh giá rủi ro

# reportDetail.risk.critical
source: Critical - High flood risk
vi: Nguy kịch - Rủi ro ngập cao

# reportDetail.risk.high
source: High - Moderate flood risk
vi: Cao - Rủi ro ngập vừa

# reportDetail.risk.medium
source: Medium - Low flood risk
vi: Trung bình - Rủi ro ngập thấp

# reportDetail.risk.low
source: Low - Minimal flood risk
vi: Thấp - Rủi ro tối thiểu

# reportDetail.description
source: Description
vi: Mô tả

# reportDetail.noDescription
source: No description provided
vi: Không có mô tả

# reportDetail.timeline
source: Timeline
vi: Mốc thời gian

# reportDetail.submitted
source: Submitted
vi: Đã gửi

# reportDetail.lastUpdated
source: Last Updated
vi: Cập nhật gần nhất

# reportDetail.completed
source: Completed
vi: Hoàn tất

# reportDetail.adminControls
source: Admin Controls
vi: Điều khiển Admin

# reportDetail.currentStatus %@
source: Current: %@
vi: Hiện tại: %@

# reportDetail.alreadyCompleted
source: This report is already completed
vi: Báo cáo này đã hoàn tất

# reportDetail.statusDesc.pending
source: Your report is awaiting review
vi: Báo cáo của bạn đang chờ xem xét

# reportDetail.statusDesc.inProgress
source: Maintenance team is working on this
vi: Đội vận hành đang xử lý

# reportDetail.statusDesc.done
source: Issue has been fixed
vi: Sự cố đã được khắc phục

# reportDetail.action.startWorking
source: Start Working
vi: Bắt đầu xử lý

# reportDetail.action.markDone
source: Mark as Done
vi: Đánh dấu hoàn tất

# reportDetail.action.completed
source: Completed
vi: Đã hoàn tất

# reportDetail.errorTitle
source: Error
vi: Lỗi

# reportDetail.invalidReportId
source: Invalid report ID
vi: Report ID không hợp lệ

# status.pending
source: Pending
vi: Đang chờ

# status.inProgress
source: In Progress
vi: Đang xử lý

# common.cancel
source: Cancel
vi: Hủy

# common.noImage
source: No image
vi: Không có ảnh

# common.imageFailed
source: Failed to load image
vi: Tải ảnh thất bại

# adminDetail.navTitle
source: Report Details
vi: Chi tiết báo cáo

# adminDetail.header.report
source: Report
vi: Báo cáo

# adminDetail.section.photoEvidence
source: Photo Evidence
vi: Ảnh minh chứng

# adminDetail.section.operatorStatus
source: Operator Status Information
vi: Thông tin trạng thái xử lý

# adminDetail.section.location
source: Location
vi: Vị trí

# adminDetail.section.citizenReport
source: Citizen Report
vi: Báo cáo của người dân

# adminDetail.section.aiValidation
source: AI Validation
vi: Xác thực AI

# adminDetail.section.riskAssessment
source: Risk Assessment
vi: Đánh giá rủi ro

# adminDetail.section.locationIntelligence
source: Location Intelligence
vi: Thông tin vị trí

# adminDetail.section.nearbyPOIs
source: Nearby Points of Interest
vi: Địa điểm lân cận

# adminDetail.section.operatorCompletion
source: Operator Completion Details
vi: Chi tiết hoàn tất xử lý

# adminDetail.section.timeline
source: Timeline
vi: Dòng thời gian

# adminDetail.field.workflowState
source: Workflow State
vi: Trạng thái quy trình

# adminDetail.field.assignedTo
source: Assigned To
vi: Phân công cho

# adminDetail.field.operatorNotes
source: Operator Notes:
vi: Ghi chú xử lý:

# adminDetail.field.drainId
source: Drain ID
vi: Mã cống

# adminDetail.field.coordinates
source: Coordinates
vi: Tọa độ

# adminDetail.map.drainMarker
source: Drain
vi: Cống

# adminDetail.field.description
source: Description
vi: Mô tả

# adminDetail.field.userSeverity
source: User Severity
vi: Mức độ (người dùng)

# adminDetail.field.trafficImpact
source: Traffic Impact
vi: Ảnh hưởng giao thông

# adminDetail.field.validated
source: Validated
vi: Kết quả

# adminDetail.value.valid
source: ✅ Valid
vi: ✅ Hợp lệ

# adminDetail.value.invalid
source: ❌ Invalid
vi: ❌ Không hợp lệ

# adminDetail.field.aiSeverity
source: AI Severity
vi: Mức độ (AI)

# adminDetail.field.aiConfidence
source: AI Confidence
vi: Độ tin cậy (AI)

# adminDetail.field.detectedIssue
source: Detected Issue
vi: Vấn đề phát hiện

# adminDetail.field.validationReasons
source: Validation Reasons:
vi: Lý do xác thực:

# adminDetail.field.rejectionReason
source: Rejection Reason
vi: Lý do từ chối

# adminDetail.field.nearSchool
source: Near School
vi: Gần trường học

# adminDetail.field.nearHospital
source: Near Hospital
vi: Gần bệnh viện

# adminDetail.field.rushHourSubmission
source: Rush Hour Submission
vi: Gửi vào giờ cao điểm

# adminDetail.field.completedAt
source: Completed At
vi: Hoàn tất lúc

# adminDetail.field.afterPhoto
source: After Photo:
vi: Ảnh sau xử lý:

# adminDetail.field.submitted
source: Submitted
vi: Đã gửi

# adminDetail.field.aiProcessed
source: AI Processed
vi: AI xử lý

# adminDetail.field.statusUpdated
source: Status Updated
vi: Cập nhật trạng thái

# adminDetail.button.startWorking
source: Start Working
vi: Bắt đầu xử lý

# adminDetail.button.markDone
source: Mark as Done
vi: Đánh dấu hoàn tất

# adminDetail.action.start.title
source: Start Working?
vi: Bắt đầu xử lý?

# adminDetail.action.start.message
source: This will move the report to In Progress and assign it to you.
vi: Thao tác này sẽ chuyển báo cáo sang Đang xử lý và gán cho bạn.

# adminDetail.action.start.button
source: Start
vi: Bắt đầu

# adminDetail.action.done.title
source: Mark as Done?
vi: Đánh dấu hoàn tất?

# adminDetail.action.done.message
source: This will mark the report as completed.
vi: Thao tác này sẽ đánh dấu báo cáo là đã hoàn tất.

# adminDetail.action.done.button
source: Complete
vi: Hoàn tất

# adminDetail.success.startWork
source: Report assigned to you and moved to In Progress
vi: Đã gán báo cáo cho bạn và chuyển sang Đang xử lý

# adminDetail.success.markDone
source: Report marked as completed
vi: Đã đánh dấu báo cáo hoàn tất
